program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(11)).
literal(4,"pos",comparison(5)).
comparison(5,number(6),guards(7)).
number(6,1).
guards(7,0,guard(8)).
guard(8,"<",number(9)).
number(9,2).
guards(7,0,guard(11)).
guard(11,"<",number(12)).
number(12,3).
