program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(10)).
% facts representing head literal rel(3,1).
literal(4,"pos",symbolic_atom(5)).
symbolic_atom(5,function(6)).
function(6,rel,terms(7)).
terms(7,0,number(8)).
number(8,2).
terms(7,1,number(9)).
number(9,1).
% facts representing body literal rel(2,2).
body_literals(10,0,body_literal(11)).
body_literal(11,"pos",symbolic_atom(12)).
symbolic_atom(12,function(13)).
function(13,rel,terms(14)).
terms(14,0,number(15)).
number(15,1).
terms(14,1,number(16)).
number(16,2).
