program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(14)).
literal(4,"pos",comparison(5)).
comparison(5,number(6),guards(7)).
number(6,1).
guards(7,0,guard(8)).
guard(8,"<",number(9)).
number(9,2).
guards(7,1,guard(10)).
guard(10,"!=",number(11)).
number(11,3).
guards(7,2,guard(12)).
guard(12,">", number(13)).
number(13,4).
