program(0,"base",constants(1),statements(2)).
statements(2,0,definition(3)).
definition(3,x,number(4),true).
number(4,42).
statements(2,1,definition(5)).
definition(5,y,function(6),false).
function(6,a,terms(7)).
