program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(12)).
literal(4,"pos",symbolic_atom(5)).
symbolic_atom(5,function(6)).
function(6,a,terms(7)).
terms(7,0,external_function(8)).
external_function(8,f,terms(9)).
terms(9,0,function(10)).
function(10,b,terms(11)).
