program(0,"base",constants(1),statements(2)).
statements(2,0,external(3)).
external(3,symbolic_atom(4),body_literals(8),false).
symbolic_atom(4,function(5)).
function(5,a,terms(6)).
terms(6,0,variable(7)).
variable(7,"X").
body_literals(8,0,body_literal(9)).
body_literal(9,"pos",symbolic_atom(10)).
symbolic_atom(10,function(11)).
function(11,c,terms(12)).
terms(12,0,variable(13)).
variable(13,"X").
body_literals(8,1,body_literal(14)).
body_literal(14,"pos",symbolic_atom(15)).
symbolic_atom(15,function(16)).
function(16,d,terms(17)).
terms(17,0,function(18)).
function(18,e,terms(19)).
terms(19,0,variable(20)).
variable(20,"X").
