program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,head_aggregate(4),body_literals(30)).
head_aggregate(4,guard(5),"#sum",head_aggregate_elements(7),guard(29)).
guard(5,"=",number(6)).
number(6,4).
head_aggregate_elements(7,0,terms(8),conditional_literal(11)).
terms(8,0,number(9)).
number(9,1).
terms(8,1,number(10)).
number(10,2).
conditional_literal(11,literal(12),literals(16)).
literal(12,"pos",symbolic_atom(13)).
symbolic_atom(13,function(14)).
function(14,a,terms(15)).
literals(16,0,literal(17)).
literal(17,"not",symbolic_atom(18)).
symbolic_atom(18,function(19)).
function(19,b,terms(20)).
head_aggregate_elements(7,1,terms(21),conditional_literal(23)).
terms(21,0,number(22)).
number(22,3).
conditional_literal(23,literal(24),literals(28)).
literal(24,"pos",symbolic_atom(25)).
symbolic_atom(25,function(26)).
function(26,c,terms(27)).
