program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,head_aggregate(4),body_literals(30)).
head_aggregate(4,guard(5),"#sum",head_aggregate_elements(7),guard(29)).
guard(5,"=",number(6)).
number(6,4).
head_aggregate_elements(7,0,terms(8),conditional_literal(11)).
terms(8,0,number(9)).
number(9,1).
terms(8,1,number(10)).
number(10,2).
conditional_literal(11,literal(12),literals(16)).
literal(12,"pos",symbolic_atom(13)).
symbolic_atom(13,function(14)).
function(14,a,terms(15)).
literals(16,0,literal(17)).
literal(17,"not",symbolic_atom(18)).
symbolic_atom(18,function(19)).
function(19,b,terms(20)).
head_aggregate_elements(7,1,terms(21),conditional_literal(23)).
terms(21,0,number(22)).
number(22,3).
conditional_literal(23,literal(24),literals(28)).
literal(24,"pos",symbolic_atom(25)).
symbolic_atom(25,function(26)).
function(26,c,terms(27)).

child(program(0),constants(1)).
child(program(0),statements(2)).
child(statements(2),rule(3)).
child(rule(3),head_aggregate(4)).
child(head_aggregate(4),guard(5)).
child(guard(5),number(6)).
child(head_aggregate(4),head_aggregate_elements(7)).
child(head_aggregate_elements(7),terms(8)).
child(terms(8),number(9)).
child(terms(8),number(10)).
child(head_aggregate_elements(7),conditional_literal(11)).
child(conditional_literal(11),literal(12)).
child(literal(12),symbolic_atom(13)).
child(symbolic_atom(13),function(14)).
child(function(14),terms(15)).
child(conditional_literal(11),literals(16)).
child(literals(16),literal(17)).
child(literal(17),symbolic_atom(18)).
child(symbolic_atom(18),function(19)).
child(function(19),terms(20)).
child(head_aggregate_elements(7),terms(21)).
child(terms(21),number(22)).
child(head_aggregate_elements(7),conditional_literal(23)).
child(conditional_literal(23),literal(24)).
child(literal(24),symbolic_atom(25)).
child(symbolic_atom(25),function(26)).
child(function(26),terms(27)).
child(conditional_literal(23),literals(28)).
child(rule(3),body_literals(30)).
