program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(6)).
literal(4,"pos",boolean_constant(5)).
boolean_constant(5,false).
body_literals(6,0,body_literal(7)).
body_literal(7,"pos",symbolic_atom(8)).
symbolic_atom(8,function(9)).
function(9,a,terms(10)).
