program(0,"base",constants(1),statements(2)).
location(program(0),position("<string>",1,1),position("<string>",1,1)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(13)).
location(rule(3),position("<string>",1,1),position("<string>",1,14)).
literal(4,"pos",symbolic_atom(5)).
location(literal(4),position("<string>",1,1),position("<string>",1,13)).
symbolic_atom(5,function(6)).
function(6,a,terms(7)).
location(function(6),position("<string>",1,1),position("<string>",1,13)).
terms(7,0,number(8)).
number(8,1).
location(number(8),position("<string>",1,3),position("<string>",1,4)).
terms(7,1,function(9)).
function(9,b,terms(10)).
location(function(9),position("<string>",1,5),position("<string>",1,6)).
terms(7,2,string(11)).
string(11,"c").
location(string(11),position("<string>",1,7),position("<string>",1,10)).
terms(7,3,variable(12)).
variable(12,"D").
location(variable(12),position("<string>",1,11),position("<string>",1,12)).


