program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(13)).
% facts representing head literal pool(2;a).
literal(4,"pos",symbolic_atom(5)).
symbolic_atom(5,function(6)).
function(6,pool,terms(7)).
terms(7,0,pool(8)).
pool(8,terms(9)).
terms(9,0,number(10)).
number(10,1).
terms(9,1,function(11)).
function(11,a,terms(12)).
