program(0,"base",constants(1),statements(2)).
statements(2,0,show_term(3)).
show_term(3,number(4),body_literals(5)).
number(4,1).
body_literals(5,0,body_literal(6)).
body_literal(6,"pos",symbolic_atom(7)).
symbolic_atom(7,function(8)).
function(8,b,terms(9)).
