program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,literal(4),body_literals(9)).
% facts representing head literal yummy("carrot").
literal(4,"pos",symbolic_atom(5)).
symbolic_atom(5,function(6)).
function(6,yummy,terms(7)).
terms(7,0,string(8)).
string(8,"carrot").
