program(0,"base",constants(1),statements(2)).
statements(2,0,rule(3)).
rule(3,theory_atom(4),body_literals(10)).
theory_atom(4,function(5),theory_atom_elements(8),theory_guard(9)).
function(5,a,terms(6)).
terms(6,0,string(7)).
string(7,"b").
